# Основной источник
# https://www.w3schools.com/python

# Привет!
# Это простой набор заданий для выполнения.
# Выполнять можно в любой последовательности. 
# Но я бы рекомендовал, чтобы все делалось по порядку и 
# с внимательным изучением источника

# Как выполнять?
# На каждой строке есть вопрос. Ответь на этот вопрос в простой форме.
# Закоментируй вопрос.
# Если есть задание с кодом - напиши код.
# После выпосления - закоментируй код и приступай к выполнению следующего задания.
# -----------------------------------------------------------------------------------

# 1. Какие бывают переменные в питоне? Напиши пример в коде.


# 2. Какие бывают типы данных в питоне? Напиши пример в коде.
# что такое метод? Что такое функция?


# 3. Покажи пример чисел. Как они объявляются? 


# 4. Есть такая штука как Casting. Еще её назыают преобразование типов. Покажи пример.


# 5. Что такое строки? Выведи мне строку.

# 6. Нареж одну строку на две.
# Покажи пример Slicins
# Раскоментируй код ниже, допиши его, проверь и закоментируй вновь.
# text = 'Hello, Mark!'

# 7. Сделай в строке все буквы заглавными. 
# Upper Case, 
# Lower Case

# 8. Раздели строку на две и помести в Lists. 
# Split String



# 9. Собери строку о одну. Покажи пример
# Concatenation
# a = 'My name'
# b = 'Makr'

# 10. Формат строки что это и как работает?
# Format String
# Покажи пример
# name = 'Mark'
# profession = 'student'
# mySpec = "Hi my name is {} and I am {}"

